fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ДниОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресВХ));
	
	ОбновитьДиаграммуГанта();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДиаграммуГанта()
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуГанта()
	
 	ГрафикОтпусков.Очистить();
 	
 	ГрафикОтпусков.Обновление = Ложь;
 
 	Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
 	
	Для Каждого Строка  Из Объект.ОтпускаСотрудников  Цикл
		
		Точка = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник);

		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);

		Интервал = Значение.Добавить();

		Интервал.Начало = Строка.ДатаНачала;

		Интервал.Конец = Строка.ДатаОкончания;

	КонецЦикла;
	
 	ГрафикОтпусков.Обновление = Истина;
 	
КонецПроцедуры
